Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_ipc.h
// SEND_CNF Configuration

#define IPC_SEND_CNF_CHEN15                             (0x1U<<15)
#define IPC_SEND_CNF_CHEN14                             (0x1U<<14)
#define IPC_SEND_CNF_CHEN13                             (0x1U<<13)
#define IPC_SEND_CNF_CHEN12                             (0x1U<<12)
#define IPC_SEND_CNF_CHEN11                             (0x1U<<11)
#define IPC_SEND_CNF_CHEN10                             (0x1U<<10)
#define IPC_SEND_CNF_CHEN9                              (0x1U<<9)
#define IPC_SEND_CNF_CHEN8                              (0x1U<<8)
#define IPC_SEND_CNF_CHEN7                              (0x1U<<7)
#define IPC_SEND_CNF_CHEN6                              (0x1U<<6)
#define IPC_SEND_CNF_CHEN5                              (0x1U<<5)
#define IPC_SEND_CNF_CHEN4                              (0x1U<<4)
#define IPC_SEND_CNF_CHEN3                              (0x1U<<3)
#define IPC_SEND_CNF_CHEN2                              (0x1U<<2)
#define IPC_SEND_CNF_CHEN1                              (0x1U<<1)
#define IPC_SEND_CNF_CHEN0                              (0x1U<<0)
#define IPC_SEND_CNF_CHEN15_DISABLE                     (0x0U<<15)
#define IPC_SEND_CNF_CHEN15_ENABLE                      (0x1U<<15)
#define IPC_SEND_CNF_CHEN14_DISABLE                     (0x0U<<14)
#define IPC_SEND_CNF_CHEN14_ENABLE                      (0x1U<<14)
#define IPC_SEND_CNF_CHEN13_DISABLE                     (0x0U<<13)
#define IPC_SEND_CNF_CHEN13_ENABLE                      (0x1U<<13)
#define IPC_SEND_CNF_CHEN12_DISABLE                     (0x0U<<12)
#define IPC_SEND_CNF_CHEN12_ENABLE                      (0x1U<<12)
#define IPC_SEND_CNF_CHEN11_DISABLE                     (0x0U<<11)
#define IPC_SEND_CNF_CHEN11_ENABLE                      (0x1U<<11)
#define IPC_SEND_CNF_CHEN10_DISABLE                     (0x0U<<10)
#define IPC_SEND_CNF_CHEN10_ENABLE                      (0x1U<<10)
#define IPC_SEND_CNF_CHEN9_DISABLE                      (0x0U<<9)
#define IPC_SEND_CNF_CHEN9_ENABLE                       (0x1U<<9)
#define IPC_SEND_CNF_CHEN8_DISABLE                      (0x0U<<8)
#define IPC_SEND_CNF_CHEN8_ENABLE                       (0x1U<<8)
#define IPC_SEND_CNF_CHEN7_DISABLE                      (0x0U<<7)
#define IPC_SEND_CNF_CHEN7_ENABLE                       (0x1U<<7)
#define IPC_SEND_CNF_CHEN6_DISABLE                      (0x0U<<6)
#define IPC_SEND_CNF_CHEN6_ENABLE                       (0x1U<<6)
#define IPC_SEND_CNF_CHEN5_DISABLE                      (0x0U<<5)
#define IPC_SEND_CNF_CHEN5_ENABLE                       (0x1U<<5)
#define IPC_SEND_CNF_CHEN4_DISABLE                      (0x0U<<4)
#define IPC_SEND_CNF_CHEN4_ENABLE                       (0x1U<<4)
#define IPC_SEND_CNF_CHEN3_DISABLE                      (0x0U<<3)
#define IPC_SEND_CNF_CHEN3_ENABLE                       (0x1U<<3)
#define IPC_SEND_CNF_CHEN2_DISABLE                      (0x0U<<2)
#define IPC_SEND_CNF_CHEN2_ENABLE                       (0x1U<<2)
#define IPC_SEND_CNF_CHEN1_DISABLE                      (0x0U<<1)
#define IPC_SEND_CNF_CHEN1_ENABLE                       (0x1U<<1)
#define IPC_SEND_CNF_CHEN0_DISABLE                      (0x0U<<0)
#define IPC_SEND_CNF_CHEN0_ENABLE                       (0x1U<<0)

// RECEIVE_CNF Configuration

#define IPC_RECEIVE_CNF_CHEN15                          (0x1U<<15)
#define IPC_RECEIVE_CNF_CHEN14                          (0x1U<<14)
#define IPC_RECEIVE_CNF_CHEN13                          (0x1U<<13)
#define IPC_RECEIVE_CNF_CHEN12                          (0x1U<<12)
#define IPC_RECEIVE_CNF_CHEN11                          (0x1U<<11)
#define IPC_RECEIVE_CNF_CHEN10                          (0x1U<<10)
#define IPC_RECEIVE_CNF_CHEN9                           (0x1U<<9)
#define IPC_RECEIVE_CNF_CHEN8                           (0x1U<<8)
#define IPC_RECEIVE_CNF_CHEN7                           (0x1U<<7)
#define IPC_RECEIVE_CNF_CHEN6                           (0x1U<<6)
#define IPC_RECEIVE_CNF_CHEN5                           (0x1U<<5)
#define IPC_RECEIVE_CNF_CHEN4                           (0x1U<<4)
#define IPC_RECEIVE_CNF_CHEN3                           (0x1U<<3)
#define IPC_RECEIVE_CNF_CHEN2                           (0x1U<<2)
#define IPC_RECEIVE_CNF_CHEN1                           (0x1U<<1)
#define IPC_RECEIVE_CNF_CHEN0                           (0x1U<<0)
#define IPC_RECEIVE_CNF_CHEN15_DISABLE                  (0x0U<<15)
#define IPC_RECEIVE_CNF_CHEN15_ENABLE                   (0x1U<<15)
#define IPC_RECEIVE_CNF_CHEN14_DISABLE                  (0x0U<<14)
#define IPC_RECEIVE_CNF_CHEN14_ENABLE                   (0x1U<<14)
#define IPC_RECEIVE_CNF_CHEN13_DISABLE                  (0x0U<<13)
#define IPC_RECEIVE_CNF_CHEN13_ENABLE                   (0x1U<<13)
#define IPC_RECEIVE_CNF_CHEN12_DISABLE                  (0x0U<<12)
#define IPC_RECEIVE_CNF_CHEN12_ENABLE                   (0x1U<<12)
#define IPC_RECEIVE_CNF_CHEN11_DISABLE                  (0x0U<<11)
#define IPC_RECEIVE_CNF_CHEN11_ENABLE                   (0x1U<<11)
#define IPC_RECEIVE_CNF_CHEN10_DISABLE                  (0x0U<<10)
#define IPC_RECEIVE_CNF_CHEN10_ENABLE                   (0x1U<<10)
#define IPC_RECEIVE_CNF_CHEN9_DISABLE                   (0x0U<<9)
#define IPC_RECEIVE_CNF_CHEN9_ENABLE                    (0x1U<<9)
#define IPC_RECEIVE_CNF_CHEN8_DISABLE                   (0x0U<<8)
#define IPC_RECEIVE_CNF_CHEN8_ENABLE                    (0x1U<<8)
#define IPC_RECEIVE_CNF_CHEN7_DISABLE                   (0x0U<<7)
#define IPC_RECEIVE_CNF_CHEN7_ENABLE                    (0x1U<<7)
#define IPC_RECEIVE_CNF_CHEN6_DISABLE                   (0x0U<<6)
#define IPC_RECEIVE_CNF_CHEN6_ENABLE                    (0x1U<<6)
#define IPC_RECEIVE_CNF_CHEN5_DISABLE                   (0x0U<<5)
#define IPC_RECEIVE_CNF_CHEN5_ENABLE                    (0x1U<<5)
#define IPC_RECEIVE_CNF_CHEN4_DISABLE                   (0x0U<<4)
#define IPC_RECEIVE_CNF_CHEN4_ENABLE                    (0x1U<<4)
#define IPC_RECEIVE_CNF_CHEN3_DISABLE                   (0x0U<<3)
#define IPC_RECEIVE_CNF_CHEN3_ENABLE                    (0x1U<<3)
#define IPC_RECEIVE_CNF_CHEN2_DISABLE                   (0x0U<<2)
#define IPC_RECEIVE_CNF_CHEN2_ENABLE                    (0x1U<<2)
#define IPC_RECEIVE_CNF_CHEN1_DISABLE                   (0x0U<<1)
#define IPC_RECEIVE_CNF_CHEN1_ENABLE                    (0x1U<<1)
#define IPC_RECEIVE_CNF_CHEN0_DISABLE                   (0x0U<<0)
#define IPC_RECEIVE_CNF_CHEN0_ENABLE                    (0x1U<<0)

// GPMEM Configuration

#define IPC_GPMEM_GPMEM                                 (0xFFFFFFFFU<<0)
#define IPC_GPMEM_GPMEM_0                               (0x1U<<0)
